{
  "main": {
    "about_me": "About me",
    "about": "About",
    "portfolio": "Portfolio",
    "skills": "Skills",
    "contact": "Contact",
    "experience": "Experience"
  },
  "elements": {
    "show_contacts": "Show contacts",
    "name": "Name",
    "message": "Your message",
    "send": "Send",
    "phone": "Phone",
    "location": "Location",
    "message_sent": "Message sent successfully!",
    "error_sending": "Error sending message."
  },
  "personal": {
    "subtitle": "Backend Developer",
    "location": "Santa Catarina, Brazil",
    "about_me": "Hello, my name is Rafael. I'm a student of Computer Science at the Federal Institute of Santa Catarina and work as a software developer.\n Since I got in touch with programming, I developed a real passion for technology. This motivation leads me to always be in search of new knowledge, exploring tools, languages and architectures that challenge me and make me evolve as a developer. Currently, I’m focused on deepening my understanding of microservice-based architectures by exploring concepts such as scalability, resilience, asynchronous communication and observability.\n I have experience with several programming languages, such as Java, Python and PHP, which allows me to adapt solutions according to the needs of the project. I am also familiar with modern development practices such as version control with Git, containerization with Docker and relational database management.\n Follow good development practices such as automated testing, code organization and use of continuous integration pipelines. I like to solve problems objectively and learn from practice in everyday development.",
    "projects": {
      "stock_prediction": {
        "title": "Stock Prediction",
        "subtitle": "Machine Learning techniques for stock prediction."
      },
      "finv": {
        "title": "FInv",
        "subtitle": "Financial investment data library."
      },
      "cup": {
        "title": "CUP",
        "subtitle": "Java library that provides a set of utilities for Java developers."
      },
      "pomotimer": {
        "title": "Pomotimer",
        "subtitle": "Pomodoro timer application."
      },
      "stroke_prediction": {
        "title": "Stroke Prediction",
        "subtitle": "Artificial neural network for stroke prediction."
      },
      "speed_test": {
        "title": "Speed Test",
        "subtitle": "Speed Test CLI with persistence of collected data."
      },
      "eight_queens": {
        "title": "8 queens",
        "subtitle": "Genetic algorithm for solving the problem of the 8 queens."
      },
      "helpdesk": {
        "title": "Help Desk",
        "subtitle": "Technical support system for help desk."
      }
    },
    "skills": {
      "programming_languages": "Programming languages",
      "frameworks": "Frameworks and libraries",
      "ai": "Artificial Intelligence",
      "tools": "Tools",
      "devops": "DevOps",
      "databases": "Databases"
    },
    "experiences": {
      "ipm": {
        "items": [
          {
            "title": "Java Apprentice Programmer",
            "date": "Jan/2024 - Jul/2024",
            "description": "Collaborate in the development and implementation of Java microservices, gaining practical experience in microservice architectures. Support in the creation of new functionalities, perform tests and ensure proper integration with other services. Maintain and refactor existing code to improve the efficiency and scalability of microservices."
          },
          {
            "title": "Java Developer",
            "date": "Jul/2024 - Currently",
            "description": "Develop and optimize Java microservices, focusing on the creation of new functionalities and on the continuous improvement of existing services. Implement agile development practices and ensure efficient integration between microservices. Perform maintenance and update of the code to ensure high availability and performance of systems. Work on solving complex problems and improving microservices architecture to support growth and scalability."
          }
        ]
      },
      "newtech": {
        "items": [
          {
            "title": "Technical support analyst internship",
            "date": "Sep/2021 - May/2022",
            "description": "Provide support and provide solutions to customer problems in management software. Realization of deployment, conversion and training of new customers. Organization and documentation of knowledge bases."
          },
          {
            "title": "Deployment Manager",
            "date": "May/2022 - Dec/2023",
            "description": "Develop customized deployment strategies according to the client’s needs. Analyze and understand customer requirements for data conversion, identifying the formats and structures required for migration. Manage the planning, resource allocation, schedules and risks associated with deployment projects."
          }
        ]
      },
      "luxpoli": {
        "title": "Administrative assistant",
        "date": "Dec/2018 - Aug/2021",
        "description": "Responsible for the registration and management of products, customers and suppliers, ensuring the accuracy of information. Manage the control of incoming and outgoing goods, including the issuance and receipt of invoices. Manage accounts receivable and perform billing control, ensuring that all financial transactions are recorded correctly. Monitor and control banking services, performing reconciliations and payments. Coordinate purchasing processes and perform customer service, ensuring satisfaction and support required."
      }
    }
  }
}
